---
kind: property
id: P:Autodesk.Revit.UI.ComboBoxMember.Image
source: html/cb3c80ea-6eb3-baf1-2004-b5235c53ac3c.htm
---
# Autodesk.Revit.UI.ComboBoxMember.Image Property

The image shown on the ComboBoxMember.

## Syntax (C#)
```csharp
public ImageSource Image { get; set; }
```

## Remarks
The image will be shown on the left side of the item.
The best size is 16 x 16 pixels.